; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v7 ?v9)
             (pred_12 ?v5 ?v3)
             (pred_8 ?v7 ?v3)
             (pred_5 ?v6 ?v7 )
	     (pred_3 ?v7)
             (pred_10 ?v13)
             (pred_9 ?v5)
             (pred_1 ?v3)
             (pred_6 ?v7)
             (pred_7 ?v5)
             (pred_4 ?v7)
             (pred_2 ))



(:action op_4
:parameters (?v10 ?v1 ?v2 ?v12)
:precondition (and (pred_10 ?v10) (pred_10 ?v1) (pred_9 ?v2) (pred_1 ?v12)
          (pred_11 ?v10 ?v1) (pred_12 ?v2 ?v12)
                   (pred_8 ?v1 ?v12) (pred_3 ?v10) 
                   (pred_6 ?v1) (pred_7 ?v2))
:effect (and  (pred_4 ?v1) (not (pred_6 ?v1))))


(:action op_3
:parameters (?v10 ?v11)
:precondition (and (pred_10 ?v10) (pred_10 ?v11)
               (pred_3 ?v10) (pred_11 ?v10 ?v11) (pred_4 ?v11))
:effect (and (pred_3 ?v11) (not (pred_3 ?v10))))

(:action op_1
:parameters (?v10 ?v2)
:precondition (and (pred_10 ?v10) (pred_9 ?v2) 
                  (pred_3 ?v10) (pred_5 ?v2 ?v10) (pred_2 ))
:effect (and (pred_7 ?v2)
   (not (pred_5 ?v2 ?v10)) (not (pred_2 ))))


(:action op_5
:parameters (?v10 ?v4 ?v8)
:precondition (and (pred_10 ?v10) (pred_9 ?v4) (pred_9 ?v8)
                  (pred_3 ?v10) (pred_7 ?v8) (pred_5 ?v4 ?v10))
:effect (and (pred_7 ?v4) (pred_5 ?v8 ?v10)
        (not (pred_7 ?v8)) (not (pred_5 ?v4 ?v10))))

(:action op_2
:parameters (?v10 ?v2)
:precondition (and (pred_10 ?v10) (pred_9 ?v2) 
                  (pred_3 ?v10) (pred_7 ?v2))
:effect (and (pred_2 ) (pred_5 ?v2 ?v10) (not (pred_7 ?v2)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_26 obj_12 obj_15 obj_19 obj_29 obj_32 obj_23 obj_31 obj_09 obj_20 obj_05 obj_21 obj_13 obj_25 obj_30 obj_27 obj_24 obj_28 obj_22 obj_03 obj_02 obj_10 obj_17 obj_14 obj_16
    obj_11 obj_04 obj_07
    obj_01 obj_08 obj_18 obj_06
    )

    (:init
       (pred_2)

       (pred_10 obj_26)
       (pred_10 obj_12)
       (pred_10 obj_15)
       (pred_10 obj_19)
       (pred_10 obj_29)
       (pred_10 obj_32)
       (pred_10 obj_23)
       (pred_10 obj_31)
       (pred_10 obj_09)
       (pred_10 obj_20)
       (pred_10 obj_05)
       (pred_10 obj_21)
       (pred_10 obj_13)
       (pred_10 obj_25)
       (pred_10 obj_30)
       (pred_10 obj_27)
       (pred_10 obj_24)
       (pred_10 obj_28)
       (pred_10 obj_22)
       (pred_10 obj_03)
       (pred_10 obj_02)
       (pred_10 obj_10)
       (pred_10 obj_17)
       (pred_10 obj_14)
       (pred_10 obj_16)
       (pred_1 obj_11)
       (pred_1 obj_04)
       (pred_1 obj_07)
       (pred_9 obj_01)
       (pred_9 obj_08)
       (pred_9 obj_18)
       (pred_9 obj_06)

       (pred_11 obj_26 obj_32)
       (pred_11 obj_26 obj_12)
       (pred_11 obj_12 obj_23)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_12 obj_26)
       (pred_11 obj_15 obj_31)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_19 obj_29)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_29 obj_20)
       (pred_11 obj_29 obj_19)
       (pred_11 obj_32 obj_05)
       (pred_11 obj_32 obj_23)
       (pred_11 obj_32 obj_26)
       (pred_11 obj_23 obj_21)
       (pred_11 obj_23 obj_31)
       (pred_11 obj_23 obj_12)
       (pred_11 obj_23 obj_32)
       (pred_11 obj_31 obj_13)
       (pred_11 obj_31 obj_09)
       (pred_11 obj_31 obj_15)
       (pred_11 obj_31 obj_23)
       (pred_11 obj_09 obj_25)
       (pred_11 obj_09 obj_20)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_09 obj_31)
       (pred_11 obj_20 obj_30)
       (pred_11 obj_20 obj_29)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_05 obj_27)
       (pred_11 obj_05 obj_21)
       (pred_11 obj_05 obj_32)
       (pred_11 obj_21 obj_24)
       (pred_11 obj_21 obj_13)
       (pred_11 obj_21 obj_23)
       (pred_11 obj_21 obj_05)
       (pred_11 obj_13 obj_28)
       (pred_11 obj_13 obj_25)
       (pred_11 obj_13 obj_31)
       (pred_11 obj_13 obj_21)
       (pred_11 obj_25 obj_22)
       (pred_11 obj_25 obj_30)
       (pred_11 obj_25 obj_09)
       (pred_11 obj_25 obj_13)
       (pred_11 obj_30 obj_03)
       (pred_11 obj_30 obj_20)
       (pred_11 obj_30 obj_25)
       (pred_11 obj_27 obj_02)
       (pred_11 obj_27 obj_24)
       (pred_11 obj_27 obj_05)
       (pred_11 obj_24 obj_10)
       (pred_11 obj_24 obj_28)
       (pred_11 obj_24 obj_21)
       (pred_11 obj_24 obj_27)
       (pred_11 obj_28 obj_17)
       (pred_11 obj_28 obj_22)
       (pred_11 obj_28 obj_13)
       (pred_11 obj_28 obj_24)
       (pred_11 obj_22 obj_14)
       (pred_11 obj_22 obj_03)
       (pred_11 obj_22 obj_25)
       (pred_11 obj_22 obj_28)
       (pred_11 obj_03 obj_16)
       (pred_11 obj_03 obj_30)
       (pred_11 obj_03 obj_22)
       (pred_11 obj_02 obj_10)
       (pred_11 obj_02 obj_27)
       (pred_11 obj_10 obj_17)
       (pred_11 obj_10 obj_24)
       (pred_11 obj_10 obj_02)
       (pred_11 obj_17 obj_14)
       (pred_11 obj_17 obj_28)
       (pred_11 obj_17 obj_10)
       (pred_11 obj_14 obj_16)
       (pred_11 obj_14 obj_22)
       (pred_11 obj_14 obj_17)
       (pred_11 obj_16 obj_03)
       (pred_11 obj_16 obj_14)
       (pred_6 obj_32)
       (pred_6 obj_09)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_8  obj_32 obj_11)
       (pred_8  obj_09 obj_04)
       (pred_8  obj_16 obj_07)
       (pred_8  obj_20 obj_04)
       (pred_4 obj_26)
       (pred_4 obj_12)
       (pred_4 obj_15)
       (pred_4 obj_19)
       (pred_4 obj_29)
       (pred_4 obj_23)
       (pred_4 obj_31)
       (pred_4 obj_05)
       (pred_4 obj_21)
       (pred_4 obj_13)
       (pred_4 obj_25)
       (pred_4 obj_30)
       (pred_4 obj_27)
       (pred_4 obj_24)
       (pred_4 obj_28)
       (pred_4 obj_22)
       (pred_4 obj_03)
       (pred_4 obj_02)
       (pred_4 obj_10)
       (pred_4 obj_17)
       (pred_4 obj_14)

       (pred_12  obj_01 obj_11)
       (pred_12  obj_08 obj_04)
       (pred_12  obj_18 obj_07)
       (pred_12  obj_06 obj_07)
       (pred_5 obj_01 obj_14)
       (pred_5 obj_08 obj_12)
       (pred_5 obj_18 obj_10)
       (pred_5 obj_06 obj_10)
       (pred_3 obj_25)
    )

    (:goal (and
       (pred_5 obj_08 obj_03)
    ))
(:constraints
  (always (not (pred_3 obj_22)))
)
)

; plan
1. (op_3 obj_25 obj_13)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_13)
   goals met: 0 of 1
2. (op_3 obj_13 obj_31)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_31)
   goals met: 0 of 1
3. (op_3 obj_31 obj_15)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_15)
   goals met: 0 of 1
4. (op_3 obj_15 obj_12)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_12)
   goals met: 0 of 1
5. (op_1 obj_12 obj_08)
   deleted: (pred_5 obj_08 obj_12) (pred_2)
   added: (pred_7 obj_08)
   goals met: 0 of 1
6. (op_3 obj_12 obj_15)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_15)
   goals met: 0 of 1
7. (op_3 obj_15 obj_31)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_31)
   goals met: 0 of 1
8. (op_3 obj_31 obj_13)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_13)
   goals met: 0 of 1
9. (op_3 obj_13 obj_25)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_25)
   goals met: 0 of 1
10. (op_3 obj_25 obj_30)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_30)
   goals met: 0 of 1
11. (op_3 obj_30 obj_03)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_03)
   goals met: 0 of 1
12. (op_2 obj_03 obj_08)
   deleted: (pred_7 obj_08)
   added: (pred_2) (pred_5 obj_08 obj_03)
   goals met: 1 of 1
